<?php
/**
 * 系统字典
 * 
 * @author samlinye <samlinye@hotmail.com>
 * @package CDict
 */

class CDict
{
    
    var $AREA_CODE_GD = array(
        '0'     => 'GD',
        '020'   => 'GZ', 
        '0755'  => 'SZ',
        '0769'  => 'DG',
        '0757'  => 'FS',
        '0759'  => 'ZJ',
        '0756'  => 'ZH',
        '0754'  => 'ST',
        '0762'  => 'HY',
        '0752'  => 'HZ',
        '0760'  => 'ZS',
        '0750'  => 'JM',
        '0662'  => 'YJ',
        '0663'  => 'JY',
        '0763'  => 'QY',
        '0751'  => 'SG',
        '0753'  => 'MZ',
        '0758'  => 'ZQ',
        '0660'  => 'SW',
        '0668'  => 'MM',
        '0768'  => 'CZ',
		'0766'  => 'YF',
    );
    
    var $AREA_CODE_GD_NAME = array(
        '0'     => '全省',
        '020'   => '广州',
        '0755'  => '深圳',
        '0769'  => '东莞',
        '0757'  => '佛山',
        '0759'  => '湛江',
        '0756'  => '珠海',
        '0754'  => '汕头',
        '0762'  => '河源',
        '0752'  => '惠州',
        '0760'  => '中山',
        '0750'  => '江门',
        '0662'  => '阳江',
        '0663'  => '揭阳',
        '0763'  => '清远',
        '0751'  => '韶关',
        '0753'  => '梅州',
        '0758'  => '肇庆',
        '0660'  => '汕尾',
        '0668'  => '茂名',
        '0768'  => '潮州',
		'0766'  => '云浮',
    );
    
  var $CITY = array(
        'GZ'   => '广州',
        'SZ'  => '深圳',
        'DG'  => '东莞',
        'FS'  => '佛山',
        'ZJ'  => '湛江',
        'ZH'  => '珠海',
        'ST'  => '汕头',
        'HY'  => '河源',
        'HZ'  => '惠州',
        'ZS'  => '中山',
        'JM'  => '江门',
        'YJ'  => '阳江',
        'JY'  => '揭阳',
        'QY'  => '清远',
        'SG'  => '韶关',
        'MZ'  => '梅州',
        'ZQ'  => '肇庆',
        'SW'  => '汕尾',
        'MM'  => '茂名',
        'CZ'  => '潮州',
		'YF'  => '云浮',
		 '0'  => '其它',
    );

	 var $SP_COMP = array(
	 	'RONDI'		 => 'E199%WI32@#SH_6_',
	 	'SF'	 => 'E1#7%WI32@#SH88_',
	 	'21CN'		 => 'E199%21CNDF@#SH_6_'
	 );
 
	function getAreaCodeGDName($area_code)
    {
      	if ($area_code)
    	{
              $area_code = ($area_code{0} != '0') ? "0{$area_code}" : $area_code;
        }
        else 
        {
              $area_code = '0';
        }

        return $this->AREA_CODE_GD_NAME[$area_code];
    }
    
}
?>
